Config/Documents/ЗавершениеРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗавершениеРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказчикДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСдачиЭтапа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СдачаЭтапаРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Госуслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блюдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>Горюче-смазочные материалы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолоднякИЖивотныеНаОткорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МягкийИнвентарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Посуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПитания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стройматериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиологическиеАктивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ЗавершениеРабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает полный список номенклатуры выполненных работ
//  для заданного документа "Завершение работ".
//
Функция НоменклатураВыполненныхРабот(ДокументЗавершениеРабот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.ДокументСдачиЭтапа КАК Ссылка
	|ПОМЕСТИТЬ ДокументыСдачиЭтапа
	|ИЗ
	|	Документ.ЗавершениеРабот.СоставРаботы КАК Док
	|ГДЕ
	|	Док.Ссылка = &ДокументЗавершениеРабот
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СдачаЭтапов.Номенклатура КАК НоменклатураРабот
	|ИЗ
	|	Документ.СдачаЭтапаРабот.СоставЭтапаРабот КАК СдачаЭтапов
	|ГДЕ
	|	СдачаЭтапов.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыСдачиЭтапа.Ссылка
	|			ИЗ
	|				ДокументыСдачиЭтапа)";
	Запрос.УстановитьПараметр("ДокументЗавершениеРабот", ДокументЗавершениеРабот);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураРабот");
	
КонецФункции

// Возвращает таблицу остатков накопленных ДБП за выполнение работ.
//
Функция НакопленныеДоходыБудущихПериодов(Период, Организация, ИФО, КФО, МассивРабот = Неопределено) Экспорт
	
	// Формируем запрос по остаткам доходов будущих периодов.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕПСБУОстатки.Счет КАК Счет,
	|	ЕПСБУОстатки.КПС КАК КПС,
	|	ЕПСБУОстатки.КЭК КАК КЭК,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|				И ЕПСБУОстатки.Счет.УчетПоПодразделениям
	|			ТОГДА ЕПСБУОстатки.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ЕПСБУОстатки.Субконто1 КАК Субконто1,
	|	ЕПСБУОстатки.Субконто2 КАК Субконто2,
	|	ЕПСБУОстатки.Субконто3 КАК Субконто3,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ЕПСБУОстатки.Субконто1) КАК НоменклатураПредставление,
	|	ЕПСБУОстатки.Валюта КАК Валюта,
	|	ЕПСБУОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСумма,
	|	ЕПСБУОстатки.СуммаОстатокКт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонПериода,
	|			Счет В (&СчетаДБП),
	|			,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И КФО = &КФО
	|				И &ОтборРабот) КАК ЕПСБУОстатки";
	
	Запрос.УстановитьПараметр("КонПериода",           Период);
	Запрос.УстановитьПараметр("Организация",          Организация);
	Запрос.УстановитьПараметр("КФО",                  КФО);
	Запрос.УстановитьПараметр("УчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Запрос.УстановитьПараметр("СчетаДБП",             БухгалтерскийУчет.СписокСчетов("401.40"));
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО",
		?(ИспользоватьУчетПоИФО, "ИФО = &ИФО", "ИСТИНА"));
	Запрос.УстановитьПараметр("ИФО", ИФО);
	
	Если МассивРабот = Неопределено Тогда
		
		УслугиРаботы = Новый Массив;
		УслугиРаботы.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
		УслугиРаботы.Добавить(Перечисления.ТипыНоменклатуры.Работа);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРабот", "ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура).ТипНоменклатуры В (&УслугиРаботы)");
		Запрос.УстановитьПараметр("УслугиРаботы", УслугиРаботы);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРабот", "Субконто1 В (&МассивРабот)");
		Запрос.УстановитьПараметр("МассивРабот", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(МассивРабот));
		
	КонецЕсли;
	
	ТаблицаОстатковДБП = Запрос.Выполнить().Выгрузить();
	ТаблицаОстатковДБП.Сортировать("Счет,НоменклатураПредставление");
	
	Возврат ТаблицаОстатковДБП;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗавершениеРабот";
	КомандаПечати.Идентификатор		= "ПФ_MXL_АктСдачиПриемкиРабот";
	КомандаПечати.Представление		= НСтр("ru = 'Акт сдачи-приемки работ'");
	КомандаПечати.Порядок			= 1;
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктСдачиПриемкиРабот") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_АктСдачиПриемкиРабот",
			"Акт сдачи-приемки работ",
			ПечатьАкта(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	Ссылка = МассивОбъектов[0];
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСдачиПриемкиРаботЗавершение";
	СтруктураДанных = ПолучитьДанныеДляПечатиАкта(Ссылка);
	ВыборкаШапка    = СтруктураДанных.ВыборкаШапка;
	ВыборкаТЧ       = СтруктураДанных.ВыборкаТЧ;
	
	Макет = ПолучитьМакет("ПФ_MXL_АктСдачиПриемкиРабот");
	ОбластьМакетаЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаЗаголовок1      = Макет.ПолучитьОбласть("Заголовок1");
	ОбластьМакетаЗаголовок2      = Макет.ПолучитьОбласть("Заголовок2");
	ОбластьМакетаНаимОрг         = Макет.ПолучитьОбласть("НаимОрг");
	ОбластьМакетаНаимОргДоп      = Макет.ПолучитьОбласть("НаимОргДоп");
	ОбластьМакетаПредОрг         = Макет.ПолучитьОбласть("ПредОрг");
	ОбластьМакетаПредОргДоп      = Макет.ПолучитьОбласть("ПредОргДоп");
	ОбластьМакетаНаимЗак         = Макет.ПолучитьОбласть("НаимЗак");
	ОбластьМакетаНаимЗакДоп      = Макет.ПолучитьОбласть("НаимЗакДоп");
	ОбластьМакетаПредЗак         = Макет.ПолучитьОбласть("ПредЗак");
	ОбластьМакетаПредЗакДоп      = Макет.ПолучитьОбласть("ПредЗакДоп");
	ОбластьМакетаСтрокаЭС        = Макет.ПолучитьОбласть("СтрокаЭС");
	ОбластьМакетаСтрокаЭВ        = Макет.ПолучитьОбласть("СтрокаЭВ");
	ОбластьМакетаИтог            = Макет.ПолучитьОбласть("Итог");
	ОбластьМакетаПодвал          = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка.Следующий();
	ОбластьМакетаЗаголовок.Параметры.Заполнить(ВыборкаШапка);
	ОбластьМакетаЗаголовок.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
	
	КолВыведенныхСтрок = ВывестиДлиннуюСтроку(ВыборкаШапка.НаименованиеОрганизации, 
																		ТабДокумент, 
																		ОбластьМакетаНаимОрг, 
																		ОбластьМакетаНаимОргДоп,
																		"НаимОргЯчейка",
																		"НаимОргДопЯчейка");
																		
	ПредставительОрганизацииДолжность = ВыборкаШапка.ПредставительОрганизацииДолжность;
	ПредставительОрганизации = ВыборкаШапка.ПредставительОрганизации;
	Корреспонденты.Просклонять(ПредставительОрганизацииДолжность, 2, ПредставительОрганизацииДолжность);
	Корреспонденты.Просклонять(ПредставительОрганизации, 2, ПредставительОрганизации);
	КолВыведенныхСтрок = ВывестиДлиннуюСтроку(?(ПредставительОрганизацииДолжность = Неопределено, "", ПредставительОрганизацииДолжность + " ") +
											  ?(ПредставительОрганизации = Неопределено, "", ПредставительОрганизации), 
												ТабДокумент, 
												ОбластьМакетаПредОрг, 
												ОбластьМакетаПредОргДоп,
												"ПредОргЯчейка",
												"ПредОргДопЯчейка");
																		
	ТабДокумент.Вывести(ОбластьМакетаЗаголовок1);
	
	КолВыведенныхСтрок = ВывестиДлиннуюСтроку(ВыборкаШапка.НаименованиеЗаказчика, 
																		ТабДокумент, 
																		ОбластьМакетаНаимЗак, 
																		ОбластьМакетаНаимЗакДоп,
																		"НаимЗакЯчейка",
																		"НаимЗакДопЯчейка");
																		
	ПредставительЗаказчикаДолжность = ВыборкаШапка.ПредставительЗаказчикаДолжность;
	ПредставительЗаказчика = ВыборкаШапка.ПредставительЗаказчика;
	Корреспонденты.Просклонять(ПредставительЗаказчикаДолжность, 2, ПредставительЗаказчикаДолжность);
	Корреспонденты.Просклонять(ПредставительЗаказчика, 2, ПредставительЗаказчика);
	КолВыведенныхСтрок = ВывестиДлиннуюСтроку(?(ПредставительЗаказчикаДолжность = Неопределено, "", ПредставительЗаказчикаДолжность + " ") +
											  ?(ПредставительЗаказчика = Неопределено, "", ПредставительЗаказчика), 
												ТабДокумент, 
												ОбластьМакетаПредЗак, 
												ОбластьМакетаПредЗакДоп,
												"ПредЗакЯчейка",
												"ПредЗакДопЯчейка");
																		
	ОбластьМакетаЗаголовок2.Параметры.Заполнить(ВыборкаШапка);																	
	ТабДокумент.Вывести(ОбластьМакетаЗаголовок2);
	
	СуммаИтого = ЗаполнитьМногострочнуюЧасть(ВыборкаТЧ, Макет, ТабДокумент, "Итог");
	
	ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаШапка);
	ОбластьМакетаПодвал.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДФ=dd.MM.yyyy");
	
	ОбластьМакетаПодвал.Параметры.Сумма    = СуммаИтого;
	ОбластьМакетаПодвал.Параметры.СуммаПрописью = ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(СуммаИтого, ВыборкаШапка.ВалютаПечати);
	
	
	ЮрАдресУчреждения = "";
	ТелефонПоЮрАдресуУчреждения = "";
	ЮрАдресУчреждения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ТелефонПоЮрАдресуУчреждения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	ОбластьМакетаПодвал.Параметры.СведенияОрганизации = "" + ВыборкаШапка.НаименованиеОрганизации + " (ИНН: " + ВыборкаШапка.ИННОрганизации + ")"
														+ " Адрес (юридический): " + ЮрАдресУчреждения + ", телефоны: " + ТелефонПоЮрАдресуУчреждения;
														
	ТелефонКонтра = "";
	ЮрАдресКонтрагента = "";
	Если Ссылка.Контрагент.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ЮрАдресКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Контрагент.ЮридическоеФизическоеЛицо, 
																							Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
		ТелефонКонтра = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Контрагент.ЮридическоеФизическоеЛицо, 
																							Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	ИначеЕсли Ссылка.Контрагент.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ЮрАдресКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Контрагент.ЮридическоеФизическоеЛицо, 
																							Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты);
		ТелефонКонтра = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Контрагент.ЮридическоеФизическоеЛицо, 
																							Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагенты);
	КонецЕсли;
	
	ОбластьМакетаПодвал.Параметры.СведенияЗаказчика = "" + ВыборкаШапка.НаименованиеЗаказчика + " (ИНН: " + ВыборкаШапка.ИННЗаказчика + ")"
														+ " Адрес (юридический): " + ЮрАдресКонтрагента + ", телефоны: " + ТелефонКонтра;
														
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечатиАкта(Ссылка)
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗавершениеРаботСостав.Ссылка.Дата,
	               |	ЗавершениеРаботСостав.ДокументСдачиЭтапа,
	               |	ЗавершениеРаботСостав.ДокументСдачиЭтапа.ЭтапСдачиРабот КАК ЭтапСдачиРаботы,
	               |	1 КАК КурсВзаиморасчетов,
	               |	1 КАК КратностьВзаиморасчетов,
	               |	&РегламентированнаяВалюта КАК ВалютаДокумента,
	               |	ЗавершениеРаботСостав.ДокументСдачиЭтапа.ВалютаДокумента КАК ВалютаДокументаЭтапа,
	               |	ВЫБОР
	               |		КОГДА ЗавершениеРаботСостав.ДокументСдачиЭтапа.ВалютаДокумента = &РегламентированнаяВалюта
	               |			ТОГДА 1
	               |		ИНАЧЕ Курсы.Курс
	               |	КОНЕЦ КАК КурсВзаиморасчетовЭтапа,
	               |	ВЫБОР
	               |		КОГДА ЗавершениеРаботСостав.ДокументСдачиЭтапа.ВалютаДокумента = &РегламентированнаяВалюта
	               |			ТОГДА 1
	               |		ИНАЧЕ Курсы.Кратность
	               |	КОНЕЦ КАК КратностьВзаиморасчетовЭтапа
	               |ПОМЕСТИТЬ ТабЧасть
	               |ИЗ
	               |	Документ.ЗавершениеРабот.СоставРаботы КАК ЗавершениеРаботСостав
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДок, ) КАК Курсы
	               |		ПО ЗавершениеРаботСостав.ДокументСдачиЭтапа.ВалютаДокумента = Курсы.Валюта
	               |ГДЕ
	               |	ЗавершениеРаботСостав.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗавершениеРабот.Номер,
	               |	ЗавершениеРабот.Дата,
	               |	ЗавершениеРабот.Организация,
	               |	ЗавершениеРабот.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	               |	ЗавершениеРабот.Организация.ИНН КАК ИННОрганизации,
	               |	ВЫБОР
	               |		КОГДА ЗавершениеРабот.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) ТОГДА ЮрЛица.НаименованиеПолное
				   |		КОГДА ЗавершениеРабот.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо) ТОГДА ФизЛица.Наименование
	               |	КОНЕЦ КАК НаименованиеЗаказчика,
	               |	ЗавершениеРабот.Контрагент КАК СсылкаЗаказчика,
	               |	ВЫБОР
	               |		КОГДА ЗавершениеРабот.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА ЮрЛица.ИНН
	               |		КОГДА ЗавершениеРабот.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА ФизЛица.ИНН
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ИННЗаказчика,
	               |	ЗавершениеРабот.ИсполнительДолжность КАК ПредставительОрганизацииДолжность,
	               |	ЗавершениеРабот.Исполнитель КАК ПредставительОрганизации,
	               |	ЗавершениеРабот.ЗаказчикДолжность КАК ПредставительЗаказчикаДолжность,
	               |	ЗавершениеРабот.Заказчик КАК ПредставительЗаказчика,
	               |	ЗавершениеРабот.Договор.ДатаДоговора КАК ДатаДоговора,
	               |	ЗавершениеРабот.Договор.НомерДоговора КАК НомерДоговора,
	               |	ПРЕДСТАВЛЕНИЕ(&РегламентированнаяВалюта) КАК ВалютаПечатиПредставление,
	               |	&РегламентированнаяВалюта КАК ВалютаПечати
	               |ИЗ
	               |	Документ.ЗавершениеРабот КАК ЗавершениеРабот
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛица
	               |		ПО ЗавершениеРабот.Контрагент.ЮридическоеФизическоеЛицо = ФизЛица.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮрЛица
	               |		ПО ЗавершениеРабот.Контрагент.ЮридическоеФизическоеЛицо = ЮрЛица.Ссылка
	               |ГДЕ
	               |	ЗавершениеРабот.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТабЧасть.Дата КАК Дата,
	               |	ТабЧасть.ЭтапСдачиРаботы.Наименование КАК ЭтапСдачи,
	               |	СдачаЭтапаРаботСоставЭтапа.НомерСтроки КАК НомерСтроки,
	               |	ВЫБОР
	               |		КОГДА СдачаЭтапаРаботСоставЭтапа.Номенклатура.НаименованиеПолное = """"
	               |			ТОГДА СдачаЭтапаРаботСоставЭтапа.Номенклатура.Наименование
	               |		ИНАЧЕ СдачаЭтапаРаботСоставЭтапа.Номенклатура.НаименованиеПолное
	               |	КОНЕЦ + "". "" + СдачаЭтапаРаботСоставЭтапа.Содержание КАК ЭтапВыполнения,
	               |	ВЫБОР
	               |		КОГДА ТабЧасть.ВалютаДокумента = ТабЧасть.ВалютаДокументаЭтапа
	               |				ИЛИ ТабЧасть.ВалютаДокумента = &ПустаяВалюта
	               |					И ТабЧасть.ВалютаДокументаЭтапа = &РегламентированнаяВалюта
	               |				ИЛИ ТабЧасть.ВалютаДокумента = &РегламентированнаяВалюта
	               |					И ТабЧасть.ВалютаДокументаЭтапа = &ПустаяВалюта
	               |			ТОГДА СдачаЭтапаРаботСоставЭтапа.Всего
	               |		ИНАЧЕ СдачаЭтапаРаботСоставЭтапа.Всего * ТабЧасть.КурсВзаиморасчетовЭтапа * ТабЧасть.КратностьВзаиморасчетов / (ТабЧасть.КурсВзаиморасчетов * ТабЧасть.КратностьВзаиморасчетовЭтапа)
	               |	КОНЕЦ КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ТабЧасть.ВалютаДокумента = ТабЧасть.ВалютаДокументаЭтапа
	               |				ИЛИ ТабЧасть.ВалютаДокумента = &ПустаяВалюта
	               |					И ТабЧасть.ВалютаДокументаЭтапа = &РегламентированнаяВалюта
	               |				ИЛИ ТабЧасть.ВалютаДокумента = &РегламентированнаяВалюта
	               |					И ТабЧасть.ВалютаДокументаЭтапа = &ПустаяВалюта
	               |			ТОГДА СдачаЭтапаРаботСоставЭтапа.СуммаНДС
	               |		ИНАЧЕ СдачаЭтапаРаботСоставЭтапа.СуммаНДС * ТабЧасть.КурсВзаиморасчетовЭтапа * ТабЧасть.КратностьВзаиморасчетов / (ТабЧасть.КурсВзаиморасчетов * ТабЧасть.КратностьВзаиморасчетовЭтапа)
	               |	КОНЕЦ КАК СуммаНДС
	               |ИЗ
	               |	ТабЧасть КАК ТабЧасть
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СдачаЭтапаРабот.СоставЭтапаРабот КАК СдачаЭтапаРаботСоставЭтапа
	               |		ПО ТабЧасть.ДокументСдачиЭтапа = СдачаЭтапаРаботСоставЭтапа.Ссылка
	               |ГДЕ
	               |	СдачаЭтапаРаботСоставЭтапа.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ТабЧ.ДокументСдачиЭтапа
	               |			ИЗ
	               |				ТабЧасть КАК ТабЧ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	НомерСтроки
	               |ИТОГИ
	               |	СУММА(Сумма),
	               |	СУММА(СуммаНДС)
	               |ПО
	               |	ОБЩИЕ,
	               |	ЭтапСдачи";
				   
	Запрос = Новый Запрос(ТекстЗапроса);			   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПустаяВалюта", Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("РегламентированнаяВалюта", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ДатаДок", Ссылка.Дата);
	МассивРезультат = Запрос.ВыполнитьПакет();
	ВыборкаШапка = МассивРезультат[1].Выбрать();
	ВыборкаТЧ    = МассивРезультат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураДанных = Новый Структура("ВыборкаШапка, ВыборкаТЧ", ВыборкаШапка, ВыборкаТЧ);
	
	Возврат(СтруктураДанных);
КонецФункции	

Функция ЗаполнитьМногострочнуюЧасть(ТекВыборка, Макет, ТабДокумент, ИмяОбласти)
	ТекОбласть = Макет.ПолучитьОбласть(ИмяОбласти);
	СуммаИтого = 0;
	СуммаНДС   = 0;
	Пока ТекВыборка.Следующий() Цикл
		Если ТекВыборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			СуммаИтого = ТекВыборка.Сумма;
			СуммаНДС   = ТекВыборка.СуммаНДС;
			Выборка = ТекВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЗаполнитьМногострочнуюЧасть(Выборка, Макет, ТабДокумент, "СтрокаЭС");
			Прервать;
		КонецЕсли;	
		
		ТекОбласть.Параметры.Заполнить(ТекВыборка);
		ТабДокумент.Вывести(ТекОбласть);
		
		Если ИмяОбласти = "СтрокаЭВ" Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = ТекВыборка.Выбрать();
		ЗаполнитьМногострочнуюЧасть(Выборка, Макет, ТабДокумент, "СтрокаЭВ");
	КонецЦикла;	
	Если ИмяОбласти = "Итог" Тогда
		ТекОбласть.Параметры.СуммаИтого = СуммаИтого;
		ТекОбласть.Параметры.СуммаНДС   = СуммаНДС;
		ТабДокумент.Вывести(ТекОбласть);
	КонецЕсли;	
	
	Возврат СуммаИтого;
КонецФункции	

Функция СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ШиринаВСимволах) Экспорт
	ТекСтрока = "";
	ВсегоСимволов = 0;
	Для к = ТекИндекс по МассивСлов.Количество()-1 Цикл
		ТекСлово = МассивСлов[к];
		ВсегоСимволов = ВсегоСимволов + СтрДлина(" " + ТекСлово);
		Если ВсегоСимволов < ШиринаВСимволах Тогда
			ТекСтрока = ТекСтрока + " " + ТекСлово;
			ТекИндекс = ТекИндекс  + 1;
		ИначеЕсли ВсегоСимволов = ШиринаВСимволах Тогда
			ТекСтрока = ТекСтрока + " " + ТекСлово;
			ТекИндекс = ТекИндекс  + 1;
			Прервать;
		Иначе
			Прервать
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ТекСтрока;
КонецФункции	

Функция ВывестиДлиннуюСтроку(Знач СтрокаВыода, ТабДокумент, Область1, Область2, НаименованиеЯчейкиОбласть1, НаименованиеЯчейкиОбласть2, 
								НачальныйИндексПараметра1 = 0) Экспорт
	СтрокаВыода = СтрЗаменить(СтрокаВыода, Символы.ПС, " ");
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВыода, " ");
	
	ЯчейкаОбласть1 = Область1.Область(НаименованиеЯчейкиОбласть1);
	ЯчейкаОбласть2 = Область2.Область(НаименованиеЯчейкиОбласть2);
	
	ТекШиринаКолонок1 = ?(ЯчейкаОбласть1.ШиринаКолонки = 0, 9, ЯчейкаОбласть1.ШиринаКолонки);
	ТекШиринаКолонок2 = ?(ЯчейкаОбласть2.ШиринаКолонки = 0, 9, ЯчейкаОбласть2.ШиринаКолонки);
	
	ЧислоСимволов1 = ТекШиринаКолонок1 * (ЯчейкаОбласть1.Право - ЯчейкаОбласть1.Лево + 1);
	ЧислоСимволов2 = ТекШиринаКолонок2 * (ЯчейкаОбласть2.Право - ЯчейкаОбласть2.Лево + 1);
	
	ТекИндекс = 0;
	Область1.Параметры.Установить(НачальныйИндексПараметра1, СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ЧислоСимволов1));
	ТабДокумент.Вывести(Область1);
	КолВыведенныхСтрок = 0;
	Пока ТекИндекс <= МассивСлов.Количество() - 1 Цикл
		Область2.Параметры.Установить(0, СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ЧислоСимволов2));
		ТабДокумент.Вывести(Область2);
		КолВыведенныхСтрок = КолВыведенныхСтрок + 1;
	КонецЦикла;	
	
	Возврат КолВыведенныхСтрок;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
